angelo-breuer.clock
anthropic.claude-code
davidanson.vscode-markdownlint
freecodecamp.freecodecamp-dark-vscode-theme
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
particle.particle-vscode-theme
sudhan.neondark-theme
vscodevim.vim
